Repository: pingfangx/TranslatorX-other
Catalog: miscellaneous/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: A client ought to limit the number of simultaneous open connections that it maintains to a given server.
zh_cn: 客户端应该限制它维护到给定服务器的同时打开的连接数。

source: A client sending a CONNECT request MUST send the authority form of request-target (Section 5.3 of [RFC7230]); i.e., the request-target consists of only the host name and port number of the tunnel destination, separated by a colon.
zh_cn: 发送 CONNECT 请求的客户端必须发送请求目标的权限形式([RFC7230] 的第 5.3 节);即，请求目标仅包含隧道目的地的主机名和端口号，用冒号分隔。

source: A client sending a message body SHOULD monitor the network connection for an error response while it is transmitting the request.
zh_cn: 发送消息体的客户端应该在发送请求时监视网络连接以获得错误响应。

source: A client sends a request to the server in the form of a request method, URI, and protocol version, followed by a MIME-like message containing request modifiers, client information, and possible body content over a connection with a server.
zh_cn: 客户端以请求方法，URI 和协议版本的形式向服务器发送请求，然后是类似 MIME 的消息，其中包含与服务器连接的请求修饰符，客户端信息和可能的正文内容。

source: A client sends an HTTP request to a server in the form of a request message, beginning with a request-line that includes a method, URI, and protocol version (Section 3.1.1), followed by header fields containing request modifiers, client information, and representation metadata (Section 3.2), an empty line to indicate the end of the header section, and finally a message body containing the payload body (if any, Section 3.3).
zh_cn: 客户端以请求消息的形式向服务器发送 HTTP 请求，从包含方法、URI 和协议版本的请求行开始(第 3.1.1 节)，后跟包含请求修饰符、客户端信息和表示元数据的首部字段(第 3.2 节)，一个空行表示首部部分的结尾，最后是一个包含有效载荷主体的消息主体(如果有的话，第 3.3 节)。

source: A client sends request header fields to provide more information about the request context, make the request conditional based on the target resource state, suggest preferred formats for the response, supply authentication credentials, or modify the expected request processing.
zh_cn: 客户端发送请求首部字段以提供有关请求上下文的更多信息，根据目标资源状态使请求成为条件的，建议响应的首选格式，提供身份验证凭据或修改预期的请求处理。

source: A client that does not support persistent connections MUST send the "close" connection option in every request message.
zh_cn: 不支持持久连接的客户端必须在每个请求消息中发送“关闭”连接选项。

source: A client that generates an OPTIONS request containing a payload body MUST send a valid Content-Type header field describing the representation media type.
zh_cn: 生成包含有效载荷主体的 OPTIONS 请求的客户端必须发送描述表示媒体类型的有效 Content-Type 首部字段。

source: A client that has more than one outstanding request on a connection MUST maintain a list of outstanding requests in the order sent and MUST associate each received response message on that connection to the highest ordered request that has not yet received a final (non-1xx) response.
zh_cn: 在连接上有多个未完成请求的客户端必须在发送的顺序中维护未完成请求的列表，并且必须将该连接上的每个接收到的响应消息与尚未收到最终请求的最高有序请求相关联(非 1xx)响应。

source: A client that pipelines requests SHOULD retry unanswered requests if the connection closes before it receives all of the corresponding responses.
zh_cn: 如果连接在收到所有相应响应之前关闭，则流水线请求的客户端应该重试未响应的请求。

source: A client that receives a "close" connection option MUST cease sending requests on that connection and close the connection after reading the response message containing the "close"; if additional pipelined requests had been sent on the connection, the client SHOULD NOT assume that they will be processed by the server.
zh_cn: 接收“close”连接选项的客户端必须停止在该连接上发送请求，并在读取包含“close”的响应消息后关闭连接；如果在连接上发送了额外的流水线请求，客户端不应该假设它们将由服务器处理。

source: A client that receives an incomplete response message, which can occur when a connection is closed prematurely or when decoding a supposedly chunked transfer coding fails, MUST record the message as incomplete.
zh_cn: 接收不完整响应消息的客户端，当连接过早关闭或解码所谓的分块传输编码失败时，可能会发生，必须将消息记录为不完整。

source: A client that sends a "close" connection option MUST NOT send further requests on that connection (after the one containing "close") and MUST close the connection after reading the final response message corresponding to this request.
zh_cn: 发送“close”连接选项的客户端不得在该连接上发送进一步的请求(在包含“close”的连接之后)，并在读取与该请求对应的最终响应消息后必须关闭连接。

source: A client that supports persistent connections MAY "pipeline" its requests (i.e., send multiple requests without waiting for each response).
zh_cn: 支持持久连接的客户端可以“流水线化”其请求(即，在不等待每个响应的情况下发送多个请求)。

source: A client which has a cached session ID set by a pre-TLS 1.3 server SHOULD set this field to that value.
zh_cn: 具有由 TLS 1.3 之前的服务器设置的缓存会话 ID 的客户端应该将该字段设置为该值。

source: A client which receives a cipher suite that was not offered MUST abort the handshake with an "illegal_parameter" alert.
zh_cn: 接收未提供的密码套件的客户端务必使用“illegal_parameter”警报中止握手。

source: A client which receives a cipher suite that was not offered MUST abort the handshake.
zh_cn: 接收未提供的密码套件的客户端必须中止握手。

source: A client which receives a legacy_session_id_echo field that does not match what it sent in the ClientHello MUST abort the handshake with an "illegal_parameter" alert.
zh_cn: 接收到与 ClientHello 中发送的内容不匹配的 legacy_session_id_echo 字段的客户端必须使用“illegal_parameter”警报中止握手。

source: A client will send an empty certificate_list if it does not have an appropriate certificate to send in response to the server's authentication request.
zh_cn: 如果客户端没有适当的证书要发送以响应服务器的身份验证请求，则会发送空的 certificate_list。

source: A client wishing to send a non-idempotent request SHOULD wait to send that request until it has received the response status for the previous request.
zh_cn: 希望发送非幂等请求的客户端应该等待发送该请求，直到它收到前一个请求的响应状态。

source: A client, server, or proxy MAY close the transport connection at any time.
zh_cn: 客户端，服务器或代理可以随时关闭传输连接。

source: A client-generated random structure.
zh_cn: 客户端生成的随机结构。

source: A companion document describes a method for using HTTP/TLS over the same port as normal HTTP [RFC2817].
zh_cn: 配套文档 [RFC2817] 描述了在与普通 HTTP 相同的端口上使用 HTTP/TLS 的方法。

source: A component's ABNF syntax rule will not use the reserved or gen-delims rule names directly; instead, each syntax rule lists the characters allowed within that component (i.e., not delimiting it), and any of those characters that are also in the reserved set are "reserved" for use as subcomponent delimiters within the component.
zh_cn: 组件的 ABNF 语法规则不会直接使用保留或 gen-delims 规则名称；相反，每个语法规则列出该组件内允许的字符(即，不对其进行分隔)，并且也保留在保留集中的那些字符中的任何一个都被“保留”以用作组件内的子组件分隔符。

source: A conditional GET method requests that the entity be transferred only under the circumstances described by the conditional header field(s).
zh_cn: 条件 GET 方法请求仅在条件首部字段描述的情况下传送实体。

source: A connection is defined by a pair of sockets.
zh_cn: 连接由一对套接字定义。

source: A connection might be used for multiple request/response exchanges, as defined in Section 6.3.
zh_cn: 连接可用于多个请求/响应交换，如第 6.3 节中所定义。

source: A connection progresses through a series of states during its lifetime.
zh_cn: 连接在其生命周期中通过一系列状态进行。

source: A construct "#" is defined, similar to "*", for defining lists of elements.
zh_cn: 定义“#”结构，类似于“*”，用于定义元素列表。

source: A conventional Diffie-Hellman computation is performed.
zh_cn: 进行常规的 Diffie-Hellman 计算。

source: A digitally-signed element is encoded as a struct DigitallySigned:
zh_cn: 数字签名元素编码为结构 DigitallySigned：

source: A failure of the handshake or other protocol error triggers the termination of the connection, optionally preceded by an alert message (Section 6).
zh_cn: 握手失败或其他协议错误会触发连接终止，可选择地在终止之前加上警报消息(第 6 节)。

source: A feature of HTTP is the typing and negotiation of data representation, allowing systems to be built independently of the data being transferred.
zh_cn: HTTP 的一个特性是数据表示的输入和协商，允许系统独立于正在传输的数据而构建。

source: A field in the handshake was out of range or inconsistent with other fields.
zh_cn: 握手中的字段超出范围或与其他字段不一致。

source: A field of type enum can only assume the values declared in the definition.
zh_cn: 枚举类型的字段只能采用定义中声明的值。

source: A field value might be preceded and/or followed by optional whitespace (OWS); a single SP preceding the field-value is preferred for consistent readability by humans.
zh_cn: 字段值可以在之前和/或之后有一个可选空格(OWS)；在字段值之前最好有单个 SP 用于人类的一致可读性。

source: A field's cryptographic processing is specified by prepending an appropriate key word designation before the field's type specification.
zh_cn: 字段的加密处理是通过在字段的类型规范之前添加适当的关键字指定来指定的。

source: A flag indicating whether the session can be used to initiate new connections.
zh_cn: 一个标志，指示会话是否可用于启动新连接。

source: A fragment identifier component is indicated by the presence of a number sign ("#") character and terminated by the end of the URI.
zh_cn: 片段标识符组件由数字符号(“#”)字符的存在表示，并由 URI 的末尾终止。

source: A fundamental notion in the design is that every octet of data sent over a TCP connection has a sequence number.
zh_cn: 设计中的一个基本概念是通过 TCP 连接发送的每个八位字节数据都有一个序列号。

source: A gateway communicates with inbound servers using any protocol that it desires, including private extensions to HTTP that are outside the scope of this specification.
zh_cn: 网关使用它期望的任何协议与入站服务器通信，包括超出本规范范围的 HTTP 的私有扩展。

source: A gateway is a receiving agent, acting as a layer above some other server(s) and, if necessary, translating the requests to the underlying server's protocol.
zh_cn: 网关是接收代理，充当某些其他服务器之上的层，并在必要时将请求转换为底层服务器的协议。

source: A given entity tag value MAY be used for entities obtained by requests on different URIs.
zh_cn: 给定的实体标签值可以用于通过不同 URI 上的请求获得的实体。

source: A handshake cryptographic operation failed, including being unable to correctly verify a signature or validate a Finished message.
zh_cn: 握手加密操作失败，包括无法正确验证签名或验证 Finished 消息。

source: A host identified by a registered name is a sequence of characters usually intended for lookup within a locally defined host or service name registry, though the URI's scheme-specific semantics may require that a specific registry (or fixed name table) be used instead.
zh_cn: 由注册名称标识的主机是通常用于在本地定义的主机或服务名称注册表中查找的字符序列，尽管 URI 的特定于方案的语义可能要求使用特定的注册表(或固定名称表)。

source: A host identified by an IPv4 literal address is represented in dotted-decimal notation (a sequence of four decimal numbers in the range 0 to 255, separated by "."), as described in [RFC1123] by reference to [RFC0952].
zh_cn: 由 IPv4 文字地址标识的主机以点分十进制表示法(由 0 到 255 的四个十进制数字的序列，由“.”分隔)表示，如 [RFC1123] 中参考 [RFC0952] 所述。

source: A host identified by an IPv6 literal address is represented inside the square brackets without a preceding version flag.
zh_cn: 由 IPv6 文字地址标识的主机在方括号内表示，没有前面的版本标志。

source: A host identified by an Internet Protocol literal address, version 6 [RFC3513] or later, is distinguished by enclosing the IP literal within square brackets ("[" and "]").
zh_cn: 由互联网协议文字地址版本 6 [RFC3513] 或更高版本标识的主机通过将 IP 文本括在方括号(“[”和“]”)中来区分。

source: A language tag identifies a natural language spoken, written, or otherwise conveyed by human beings for communication of information to other human beings.
zh_cn: 语言标签识别人类所说的，书写的或以其他方式传达的自然语言，用于将信息传递给其他人。

source: A legacy TLS client performing renegotiation with TLS 1.2 or prior and which receives a TLS 1.3 ServerHello during renegotiation MUST abort the handshake with a "protocol_version" alert.
zh_cn: 旧版 TLS 客户端使用 TLS 1.2 或更早版本执行重新协商，并在重新协商期间接收 TLS 1.3 ServerHello，必须使用“protocol_version”警报中止握手。

source: A list of extensions.
zh_cn: 扩展列表。

source: A list of the distinguished names [X501] of acceptable certificate_authorities, represented in DER-encoded format.
zh_cn: 可接受的 certificate_authorities 的可分辨名称 [X501] 的列表，以 DER 编码格式表示。

source: A list of the hash/signature algorithm pairs that the server is able to verify, listed in descending order of preference.
zh_cn: 服务器能够验证的散列/签名算法对的列表，按优先级的降序列出。

source: A list of the types of certificate types that the client may offer.
zh_cn: 客户端可能提供的证书类型类型的列表。

source: A low-entropy secret, or password, is subject to dictionary attacks based on the PSK binder.
zh_cn: 低熵密码或密码受基于 PSK 活页夹的字典攻击。

source: A message body that uses the chunked transfer coding is incomplete if the zero-sized chunk that terminates the encoding has not been received.
zh_cn: 如果尚未接收到终止编码的零大小的块，则使用分块传输编码的消息体是不完整的。

source: A message could not be decoded because some field was out of the specified range or the length of the message was incorrect.
zh_cn: 无法解码消息，因为某些字段超出指定范围或消息长度不正确。

source: A message that uses a valid Content-Length is incomplete if the size of the message body received (in octets) is less than the value given by Content-Length.
zh_cn: 如果收到的消息体的大小(以八位字节为单位)小于 Content-Length 给出的值，则使用有效 Content-Length 的消息不完整。

source: A message-body MUST NOT be included in a request if the specification of the request method (section 5.1.1) does not allow sending an entity-body in requests.
zh_cn: 如果请求方法的规范(第 5.1.1 节)不允许在请求中发送实体主体，则消息主体不得包含在请求中。

source: A more complete subscribe call example looks like this:
zh_cn: 更完整的 subscribe 调用示例如下所示：

source: A more complicated situation occurs when one or more intermediaries are present in the request/response chain.
zh_cn: 当请求/响应链中存在一个或多个中介时，会出现更复杂的情况。

source: A more subtle bug happens if the call to `request(1)` triggers an asynchronous call to `onNext` on some other thread and reading `name` in `onNext` races writing it in `onStart` post `request`.
zh_cn: 还可能发生更微妙的错误，如果对 `request(1)` 的调用在某个其他线程上触发对 `onNext` 的异步调用，该调用在 `onNext` 中读取 `name`，而在 `onStart` 中 `request` 之后才会写入。（译注：不知道对不对，太难了）

source: A network data object or service that can be identified by a URI, as defined in section 3.2.
zh_cn: 可以通过 URI 标识的网络数据对象或服务，如第 3.2 节中所定义。

source: A new acknowledgment (called an "acceptable ack"), is one for which the inequality below holds:
zh_cn: 新的确认(称为“可接受的确认”)是下面的不等式所持有的：

source: A non-anonymous server can optionally request a certificate from the client, if appropriate for the selected cipher suite.
zh_cn: 非匿名服务器可以选择从客户端请求证书(如果适用于所选加密套件)。

source: A number of TLS messages contain tag-length-value encoded extensions structures.
zh_cn: 许多 TLS 消息包含标记长度值编码的扩展结构。

source: A parser of the generic URI syntax can parse any URI reference into its major components.
zh_cn: 通用 URI 语法的解析器可以将任何 URI 引用解析为其主要组件。

source: A partial GET requests that only part of the entity be transferred, as described in section 14.35.
zh_cn: 部分 GET 请求仅传输实体的一部分，如第 14.35 节所述。

source: A path consists of a sequence of path segments separated by a slash ("/") character.
zh_cn: 路径由一系列由斜杠(“/”)字符分隔的路径段组成。

source: A path is always defined for a URI, though the defined path may be empty (zero length).
zh_cn: 始终为 URI 定义路径，但定义的路径可能为空(零长度)。

source: A path segment that contains a colon character (e.g., "this:that") cannot be used as the first segment of a relative-path reference, as it would be mistaken for a scheme name.
zh_cn: 包含冒号字符(例如，“this:that”)的路径段不能用作相对路径引用的第一个段，因为它会被误认为是方案名称。

source: A payload within a CONNECT request message has no defined semantics; sending a payload body on a CONNECT request might cause some existing implementations to reject the request.
zh_cn: CONNECT 请求消息中的有效载荷没有定义的语义；在 CONNECT 请求上发送有效载荷主体可能会导致某些现有实现拒绝该请求。

source: A payload within a GET request message has no defined semantics; sending a payload body on a GET request might cause some existing implementations to reject the request.
zh_cn: GET 请求消息中的有效载荷没有定义的语义；在 GET 请求上发送有效载荷主体可能会导致某些现有实现拒绝该请求。

source: A payload within a HEAD request message has no defined semantics; sending a payload body on a HEAD request might cause some existing implementations to reject the request.
zh_cn: HEAD 请求消息中的有效载荷没有定义的语义；在 HEAD 请求上发送有效载荷主体可能会导致某些现有实现拒绝该请求。

source: A peer which receives a handshake message in an unexpected order MUST abort the handshake with an "unexpected_message" alert.
zh_cn: 以意外顺序接收握手消息的对等端必须使用“unexpected_message”警报中止握手。

source: A percent-encoded octet is encoded as a character triplet, consisting of the percent character "%" followed by the two hexadecimal digits representing that octet's numeric value.
zh_cn: 百分比编码的八位字节被编码为字符三元组，由百分号“%”后跟两个十六进制数字组成，后者表示该八位字节的数值。

source: A percent-encoding mechanism is used to represent a data octet in a component when that octet's corresponding character is outside the allowed set or is being used as a delimiter of, or within, the component.
zh_cn: 百分比编码机制用于表示一个组件中的数据八位字节，当该八位字节的对应字符在允许的集之外，或用作该组件的分隔符或在该组件内时。

source: A program that establishes connections for the purpose of sending requests.
zh_cn: 为发送请求而建立连接的程序。

source: A program's local store of response messages and the subsystem that controls its message storage, retrieval, and deletion.
zh_cn: 程序的本地响应消息存储以及控制其消息存储，检索和删除的子系统。

source: A protocol element (e.g., an entity tag or a Last-Modified time) that is used to find out whether a cache entry is an equivalent copy of an entity.
zh_cn: 用于确定缓存条目是否是实体的等效副本的协议元素(例如，实体标签或最后修改时间)。

source: A proxy MUST NOT automatically retry non-idempotent requests.
zh_cn: 代理不得自动重试非幂等请求。

source: A proxy MUST NOT generate a Max-Forwards header field while forwarding a request unless that request was received with a Max-Forwards field.
zh_cn: 除非收到的请求包含 Max-Forwards 字段，否则代理不得在转发请求时生成 Max-Forwards 首部字段。

source: A proxy MUST forward unrecognized header fields unless the field-name is listed in the Connection header field (Section 6.1) or the proxy is specifically configured to block, or otherwise transform, such fields.
zh_cn: 除非在 Connection 首部字段(第 6.1 节)中列出了字段名称，否则代理必须转发无法识别的首部字段，或者代理专门配置为阻止或以其他方式转换此类字段。

source: A proxy MUST implement both the client and server requirements of this specification.
zh_cn: 代理必须实现此规范的客户端和服务器要求。

source: A proxy MUST remove any such whitespace from a response message before forwarding the message downstream.
zh_cn: 在转发下游消息之前，代理必须从响应消息中删除任何此类空格。

source: A proxy SHOULD use up to 2*N connections to another server or proxy, where N is the number of simultaneously active users.
zh_cn: 代理应该使用最多 2 * N 个连接到另一个服务器或代理，其中 N 是同时活动用户的数量。

source: A proxy is a forwarding agent, receiving requests for a URI in its absolute form, rewriting all or part of the message, and forwarding the reformatted request toward the server identified by the URI.
zh_cn: 代理是转发代理，以绝对形式接收 URI 请求，重写全部或部分消息，并将重新格式化的请求转发到由 URI 标识的服务器。

source: A proxy or gateway MUST parse a received Connection header field before a message is forwarded and, for each connection-option in this field, remove any header field(s) from the message with the same name as the connection-option, and then remove the Connection header field itself (or replace it with the intermediary's own connection options for the forwarded message).
zh_cn: 在转发消息之前，代理或网关必须解析收到的 Connection 首部字段，对于此字段中的每个连接选项，从消息中删除任何与 connection-option 同名的首部字段，然后删除 Connection 首部字段本身（或用中间人自己的转发消息连接选项替换它）。

source: A proxy or gateway that receives an obs-fold in a response message that is not within a message/http container MUST either discard the message and replace it with a 502 (Bad Gateway) response, preferably with a representation explaining that unacceptable line folding was received, or replace each received obs-fold with one or more SP octets prior to interpreting the field value or forwarding the message downstream.
zh_cn: 在不在 message/http 容器中的响应消息中接收 obs 折叠的代理或网关必须要么丢弃该消息并用 502(坏网关)响应替换它，最好使用解释接收到不可接受的行折叠的表示，或者在解释字段值或向下游转发消息之前，用一个或多个 SP 八位字节替换每个接收到的 obs 折叠。

source: A proxy server MUST NOT establish a HTTP/1.1 persistent connection with an HTTP/1.0 client (but see RFC 2068 [33] for information and discussion of the problems with the Keep-Alive header implemented by many HTTP/1.0 clients).
zh_cn: 代理服务器不得与 HTTP/1.0 客户端建立 HTTP/1.1 持久连接(但请参阅 RFC 2068 [33] 以获取有关许多 HTTP/1.0 客户端实现的 Keep-Alive 首部问题的信息和讨论)。

source: A proxy server MUST NOT maintain a persistent connection with an HTTP/1.0 client (see Section 19.7.1 of [RFC2068] for information and discussion of the problems with the Keep-Alive header field implemented by many HTTP/1.0 clients).
zh_cn: 代理服务器不得与 HTTP/1.0 客户端保持持久连接(有关许多 HTTP/1.0 客户端实现的 Keep-Alive 首部字段问题的信息和讨论，请参见 [RFC2068] 的第 19.7.1 节)。

source: A proxy that forwards such a request MUST generate a new Host field-value based on the received request-target rather than forward the received Host field-value.
zh_cn: 转发此类请求的代理必须根据接收到的请求目标生成新的主机字段值，而不是转发接收到的主机字段值。

source: A public-key-encrypted element is encoded as an opaque vector <0..2^16-1>, where the length is specified by the encryption algorithm and key.
zh_cn: 公钥加密的元素被编码为不透明 vector <0..2^16-1>，其中长度由加密算法和密钥指定。

source: A range header might be forwarded by a 1.0 proxy that does not understand multipart/byteranges; in this case the server MUST delimit the message using methods defined in items 1,3 or 5 of this section.
zh_cn: 范围首部可能由 1.0 代理转发，该代理不理解 multipart/byteranges;在这种情况下，服务器必须使用本节第 1,3 或 5 项中定义的方法来分隔消息。

source: A recipient MAY combine multiple header fields with the same field name into one "field-name: field-value" pair, without changing the semantics of the message, by appending each subsequent field value to the combined field value in order, separated by a comma.
zh_cn: 接收者可以将具有相同字段名称的多个首部字段组合成一个“field-name: field-value”对，而不改变消息的语义，方法是将每个后续字段值按顺序附加到组合字段值，由逗号分隔。

source: A recipient MAY replace any linear white space with a single SP before interpreting the field value or forwarding the message downstream.
zh_cn: 在解释字段值或向下游转发消息之前，接收方可以用单个 SP 替换任何线性空白区域。

source: A recipient MUST be able to parse the chunked transfer coding (Section 4.1) because it plays a crucial role in framing messages when the payload body size is not known in advance.
zh_cn: 接收方必须能够解析分块传输编码(第 4.1 节)，因为它在预先知道有效载荷主体大小时在帧消息中起着至关重要的作用。

source: A recipient MUST interpret a received protocol element according to the semantics defined for it by this specification, including extensions to this specification, unless the recipient has determined (through experience or configuration) that the sender incorrectly implements what is implied by those semantics.
zh_cn: 接收方必须根据本规范为其定义的语义解释接收的协议元素，包括对此规范的扩展，除非接收方已经(通过经验或配置)确定发送方错误地实现了这些语义隐含的内容。

source: A recipient MUST parse an HTTP message as a sequence of octets in an encoding that is a superset of US-ASCII [USASCII].
zh_cn: 接收者必须将 HTTP 消息解析为编码中的八位字节序列，该编码是 US-ASCII [USASCII] 的超集。

source: A recipient MUST parse for such bad whitespace and remove it before interpreting the protocol element.
zh_cn: 接收者必须解析这样的坏空格并在解释协议元素之前将其删除。

source: A recipient SHOULD NOT attempt to autocorrect and then process the request without a redirect, since the invalid request-line might be deliberately crafted to bypass security filters along the request chain.
zh_cn: 接收者不应尝试自动更正，然后在没有重定向的情况下处理请求，因为可能会故意制造无效的请求行以绕过请求链中的安全过滤器。

source: A recipient SHOULD treat other octets in field content (obs-text) as opaque data.
zh_cn: 接收者应该将字段内容(obs-text)中的其他八位字节视为不透明数据。

source: A recipient can assume that a message with a higher minor version, when sent to a recipient that has not yet indicated support for that higher version, is sufficiently backwards-compatible to be safely processed by any implementation of the same major version.
zh_cn: 接收者可以假设具有较高次要版本的邮件在发送给尚未表示支持该较高版本的接收者时，具有足够的向后兼容性，可由相同主要版本的任何实现安全地处理。

source: A recipient determines whether a connection is persistent or not based on the most recently received message's protocol version and Connection header field (if any):
zh_cn: 接收者根据最近收到的消息的协议版本和 Connection 首部字段(如果有)确定连接是否持久：

source: A recipient that processes such a URI reference MUST reject it as invalid.
zh_cn: 处理此类 URI 引用的接收者必须将其拒绝为无效。

source: A recipient that receives whitespace between the start-line and the first header field MUST either reject the message as invalid or consume each whitespace-preceded line without further processing of it (i.e., ignore the entire line, along with any subsequent lines preceded by whitespace, until a properly formed header field is received or the header section is terminated).
zh_cn: 在起始行和第一个首部字段之间接收空格的接收者必须将消息拒绝为无效，或者消耗每个前面的空行而不进一步处理它(即忽略整行，以及前面有空格的任何后续行，直到收到正确形式的首部字段或终止首部部分)。

source: A registered name intended for lookup in the DNS uses the syntax defined in Section 3.5 of [RFC1034] and Section 2.1 of [RFC1123].
zh_cn: 用于在 DNS 中查找的注册名称使用 [RFC1034] 的第 3.5 节和 [RFC1123] 的第 2.1 节中定义的语法。

source: A relative reference takes advantage of the hierarchical syntax (Section 1.2.3) to express a URI reference relative to the name space of another hierarchical URI.
zh_cn: 相对引用利用分层语法(第 1.2.3 节)来表示相对于另一个分层 URI 的名称空间的 URI 引用。
